<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"5ffeeb181911f78466d482be06329dd73889e905d9039ed5cbfb399462d72f73","plan_job_ref":"Job Test terraform-refresh #71 at https://github.com/dflook/terraform-github-actions/actions/runs/17349369246","plan_out_hash":"ac707db846879686631d029972e600b8c515f8d5f3bd50e996d3cc72be0b2d0e","plan_hash":"5f134f55843845a5503a24d4ca908b8c2922ddb767b28bdd4d6b6fd55fc7ad85","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-refresh__
:recycle: Skipping refresh of resource state
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.one will be created
+   resource "local_file" "one" {
+       content              = "this is my first file"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "test"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Test terraform-refresh #71](https://github.com/dflook/terraform-github-actions/actions/runs/17349369246)